admbase/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ВидНоменклатуры</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСтола</name>
    <type>
      <types>EnumRef.ВидыСтолов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаДляРецептов</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияМеню</name>
    <type>
      <types>CatalogRef.КатегорииМеню</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоБлюд</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДляМеню</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДляРецептов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СодержитЕдиницХранения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостояниеБлюда</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СоставНабора</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>кКал</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

admbase/src/Catalogs/ВидыНоменклатуры/ВидыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыНоменклатуры</name>
  <predefined>
    <items>
      <name>Блюда</name>
      <description>Блюда</description>
    </items>
    <items>
      <name>Меню</name>
      <description>Меню</description>
    </items>
    <items>
      <name>Продукты</name>
      <description>Продукты</description>
    </items>
  </predefined>
</mdclass:Catalog>

admbase/src/Catalogs/Номенклатура/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если  ОбменДанными.Загрузка Тогда
		ПроверяемыеРеквизиты.Очистить();
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("НеПроверятьЕдиницу") Тогда  //Запись новой единицы измерения
		УдалитьЭлементМассива("ЕдиницаИзмерения",ПроверяемыеРеквизиты);
	КонецЕсли;
	
	Если ВидНоменклатуры = Справочники.ВидыНоменклатуры.Блюда Тогда
		УдалитьЭлементМассива("ЕдиницаДляРецептов",ПроверяемыеРеквизиты);          
	Иначе
		УдалитьЭлементМассива("КоличествоБлюд",ПроверяемыеРеквизиты);          
	КонецЕсли;
	                                                                                                          
	Если ВидНоменклатуры = Справочники.ВидыНоменклатуры.Меню Тогда
		УдалитьЭлементМассива("ЕдиницаИзмерения",	ПроверяемыеРеквизиты);
		УдалитьЭлементМассива("ЕдиницаДляРецептов",	ПроверяемыеРеквизиты);
	Иначе
		УдалитьЭлементМассива("КатегорияМеню",	ПроверяемыеРеквизиты);
		УдалитьЭлементМассива("ВидСтола",		ПроверяемыеРеквизиты);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти       

#Область СлужебныеПроцедурыИФункции
					 	
Процедура УдалитьЭлементМассива(ЗначениеЭлемента,МассивЭлементов)

	 Индекс = МассивЭлементов.Найти(ЗначениеЭлемента);
	 Если Не Индекс = Неопределено Тогда
	 
	 	МассивЭлементов.Удалить(Индекс);
	 
	 КонецЕсли;

КонецПроцедуры

#КонецОбласти 

#КонецЕсли
